In [1]:
import numpy as np
import pandas as pd

In [5]:
df = pd.read_csv("data\data.csv", encoding = 'ISO-8859-1')

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\anage\AppData\Local\Temp\ipykernel_16648\434864933.py:1: SyntaxWarning: invalid escape sequence '\d'
  df = pd.read_csv("data\data.csv", encoding = 'ISO-8859-1')

In [9]:
df['Description'] = df['Description'].str.lower()

In [15]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,white hanging heart t-light holder,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,white metal lantern,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,cream cupid hearts coat hanger,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,knitted union flag hot water bottle,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,red woolly hottie white heart.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [19]:
d = { "InvoiceNo":"invoice_no",
     "StockCode":"stock_code",
     "Description":"description",
     "Quantity":"quantity",
     "InvoiceDate":"invoice_dt",
     "UnitPrice":"unit_price",
     "CustomerID":"customer_id"
}

In [25]:
df.rename(columns = {'Country':'country'}, inplace = True)

In [27]:
df.head()

,invoice_no,stock_code,description,quantity,invoice_dt,unit_price,customer_id,country
0,536365,85123A,white hanging heart t-light holder,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,white metal lantern,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,cream cupid hearts coat hanger,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,knitted union flag hot water bottle,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,red woolly hottie white heart.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoice_no   541909 non-null  object
 1   stock_code   541909 non-null  object
 2   description  540455 non-null  object
 3   quantity     541909 non-null  int64
 4   invoice_dt   541909 non-null  datetime64[ns]
 5   unit_price   541909 non-null  float64
 6   customer_id  406829 non-null  float64
 7   country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [37]:
df['invoice_dt'] = pd.to_datetime(df['invoice_dt'])

In [45]:
col_order = ['invoice_no','invoice_dt', 'customer_id','stock_code','description','quantity','unit_price','country']

In [47]:
df= df[col_order]

In [59]:
orders = df.groupby(by=['customer_id','country'],as_index = False)['invoice_no'].count()

In [61]:
orders.sort_values(by='invoice_no', ascending = False).head()

      customer_id         country  invoice_no
4050      17841.0  United Kingdom        7983
1903      14911.0            EIRE        5903
1308      14096.0  United Kingdom        5128
338       12748.0  United Kingdom        4642
1682      14606.0  United Kingdom        2782

In [63]:
df['amount_spent'] = df['unit_price']*df['quantity']

C:\Users\anage\AppData\Local\Temp\ipykernel_16648\869284215.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['amount_spent'] = df['unit_price']*df['quantity']

In [69]:
df.groupby(by=['customer_id','country'], as_index=False)['amount_spent'].sum().sort_values(by= 'amount_spent', ascending = False).head()

      customer_id         country  amount_spent
1711      14646.0     Netherlands     279489.02
4241      18102.0  United Kingdom     256438.49
3766      17450.0  United Kingdom     187482.17
1903      14911.0            EIRE     132572.62
57        12415.0       Australia     123725.45

In [71]:
df.groupby(by=['customer_id','country'], as_index=False)['quantity'].sum().sort_values(by= 'quantity', ascending = False).head()

      customer_id         country  quantity
1711      14646.0     Netherlands    196719
57        12415.0       Australia     77242
1903      14911.0            EIRE     77180
3766      17450.0  United Kingdom     69029
4241      18102.0  United Kingdom     64122